ССЫЛКА НА ИСТОЧНИК ЗАДАЧ: https://sql-academy.org/ru/trainer

Задание 1

Вывести имена всех людей, которые есть в базе данных авиакомпаний

In [ ]:
SELECT p.name
FROM Passenger as p

Задание 2

Вывести названия всеx авиакомпаний

In [ ]:
SELECT c.name
FROM Company as c

Задание 3

Вывести все рейсы, совершенные из Москвы

In [ ]:
SELECT t.*
FROM Trip as t
WHERE t.town_from = 'Moscow'

Задание 4

Вывести имена людей, которые заканчиваются на "man"

In [ ]:
SELECT p.name
FROM Passenger as p
WHERE p.name LIKE '%man'

Задание 5

Вывести количество рейсов, совершенных на TU-134

In [ ]:
SELECT t.count(*) as count
FROM Trip as t
WHERE t.plane = 'TU-134'

Задание 6

Какие компании совершали перелеты на Boeing

In [ ]:
SELECT c.name
FROM Company as c
	INNER JOIN Trip as t ON c.id = t.company
WHERE t.plane = 'Boeing'
GROUP BY c.name

Задание 7

Вывести все названия самолётов, на которых можно улететь в Москву (Moscow)

In [ ]:
SELECT t.plane
FROM Trip as t
WHERE t.town_from = 'Moscow'
GROUP BY t.plane

Задание 8

В какие города можно улететь из Парижа (Paris) и сколько времени это займёт?

In [ ]:
SELECT t.town_to,
	TIMEDIFF(t.time_in, t.time_out) as flight_time
FROM Trip as t
WHERE t.town_from = 'Paris'

Задание 9

Какие компании организуют перелеты из Владивостока (Vladivostok)?

In [ ]:
SELECT c.name
FROM Company as c
WHERE c.id IN (
		SELECT t.company
		FROM Trip as t
		WHERE t.town_from = 'Vladivostok'
	)

Задание 10

Вывести вылеты, совершенные с 10 ч. по 14 ч. 1 января 1900 г.

In [ ]:
SELECT t.*
FROM Trip as t
WHERE t.time_out BETWEEN '1900-01-01 10:00:00' AND '1900-01-01 14:00:00'

Задание 11

Вывести пассажиров с самым длинным именем

In [ ]:
SELECT p.name
FROM Passenger as p
WHERE LENGTH(p.name) = (
		SELECT MAX(LENGTH(p.name))
		FROM Passenger as p
	)

Задание 12

Вывести id и количество пассажиров для всех прошедших полётов

In [ ]:
SELECT t.id as trip,
	COUNT(p.passenger) as count
FROM Trip as t
INNER JOIN Pass_in_trip as p ON t.id = p.trip
GROUP BY t.id

Задание 13

Вывести имена людей, у которых есть полный тёзка среди пассажиров

In [ ]:
SELECT p.name
FROM Passenger as p
GROUP BY p.name
HAVING COUNT(*) > 1

Задание 14

В какие города летал Bruce Willis

In [ ]:
SELECT t.town_to
FROM Trip as t
INNER JOIN Pass_in_trip as p ON t.id = p.trip
INNER JOIN Passenger as ps ON p.passenger = ps.id
WHERE ps.name = 'Bruce Willis'

Задание 15

Выведите дату и время прилёта пассажира Стив Мартин (Steve Martin) в Лондон (London)

In [ ]:
SELECT t.time_in
FROM Trip as t
INNER JOIN Pass_in_trip as p ON t.id = p.trip
INNER JOIN Passenger as ps ON p.passenger = ps.id
WHERE ps.name = 'Steve Martin'
AND t.town_to = 'London'

Задание 16

Вывести отсортированный по количеству перелетов (по убыванию) и имени (по возрастанию) список пассажиров, совершивших хотя бы 1 полет.

In [ ]:
SELECT p.name,
COUNT(pt.trip) as count
FROM Passenger as p
INNER JOIN Pass_in_trip as pt ON p.id = pt.passenger
GROUP BY p.name
ORDER BY COUNT(pt.trip) DESC, p.name

Задание 17

Определить, сколько потратил в 2005 году каждый из членов семьи. В результирующей выборке не выводите тех членов семьи, которые ничего не потратили.

In [ ]:
SELECT f.member_name, f.status, SUM(p.amount * p.unit_price) as costs
FROM FamilyMembers as f
INNER JOIN Payments as p ON f.member_id = p.family_member
WHERE YEAR(p.date) = 2005
GROUP BY f.member_name, f.status

Задание 18

Узнать, кто старше всех в семьe

In [ ]:
SELECT f.member_name
FROM FamilyMembers as f
WHERE YEAR(f.birthday) = (
		SELECT MIN(YEAR(f.birthday))
		FROM FamilyMembers as f
	)

Задание 19

Определить, кто из членов семьи покупал картошку (potato)

In [ ]:
SELECT f.status
FROM FamilyMembers as f
INNER JOIN Payments as p ON f.member_id = p.family_member
INNER JOIN Goods as g ON p.good = g.good_id
WHERE g.good_name = 'potato'
GROUP BY f.status

Задание 20

Сколько и кто из семьи потратил на развлечения (entertainment). Вывести статус в семье, имя, сумму

In [ ]:
SELECT f.status, f.member_name, SUM(p.unit_price * p.amount) as costs
FROM FamilyMembers as f
INNER JOIN Payments as p ON f.member_id = p.family_member
INNER JOIN Goods as g ON p.good = g.good_id
INNER JOIN GoodTypes as gt ON g.type = gt.good_type_id
WHERE gt.good_type_name = 'entertainment'
GROUP BY f.status, f.member_name